nc: 8 
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]  # S1            3,  640, 640        -> 16, 64,  160, 160
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]  # S2          16, 64,  160, 160   -> 16, 256, 160, 160
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]  # S3        16, 256, 160, 160   -> 16, 512, 80, 80
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]  # S4        16, 512, 80, 80     -> 16, 1024, 40, 40
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]  # S5       16, 1024, 40, 40    -> 16, 2048, 20, 20

head:
  - [4, 1, Conv, [256, 3, 2, None, 1, 1, False]]  # 5                        
  - [-1, 1, Conv, [256, 1, 1]]  # 6                     

  - [3, 1, Conv, [256, 3, 2, None, 1, 1, False]]                         
  - [-1, 1, Conv, [256, 1, 1]]  #8                      

  - [2, 1, Conv, [256, 3, 2, None, 1, 1, False]]             
  - [-1, 1, Conv, [256, 1, 1]] # 13                     

  - [[6,8,10], 1, LDDETRDecoder, [nc]]  
